Courses/7140/Lectures/Examples/Telegram-Problem/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-06-26 Tue 09:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Peter Naur's "Telegram Problem"</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
<meta name="description" content="Software Engineering"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Peter Naur's "Telegram Problem"</h1>

<div id="outline-container-org148f0ff" class="outline-2">
<h2 id="org148f0ff"><span class="section-number-2">1</span> As Stated Originally</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>"Write a program that takes a number w, then accepts lines of text
and outputs lines of text, where the output lines have as many
words as possible but are never longer than w characters. Words may
not be split, but you may assume that no single word is too long
for a line."</li>

<li>Originally described in 196x by Peter Naur, 2005 Turing Award
Winner.</li>
</ol>
</div>
</div>

<div id="outline-container-org0002e0f" class="outline-2">
<h2 id="org0002e0f"><span class="section-number-2">2</span> Task at Hand</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>This is essentially word-wrapping within a paragraph of a text
editor.  "As such, it is a classic Object Oriented problem, used as
an example in the Design Patterns Book."</li>

<li>There are several research papers published on this problem.  See below.</li>

<li>Do a requirement analysis.  E.g.: What assumptions must we make so that
this problem is doable?</li>
</ol>
</div>

<div id="outline-container-orgff464fa" class="outline-3">
<h3 id="orgff464fa"><span class="section-number-3">2.1</span> Exam Questions</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Develop clearly stated specs, in (i) well chosen English, and also
in (ii) Math + Logic + Grammar, for Peter Naur's Telegram problem
reproduced here.  Resolve all ambiguities, "sins",
etc. sympathetically, and focus on specs. "Given a text consisting
of words separated by BLANKS or by NL (new line) characters,
convert it to a line-by-line form in accordance with the following
rules: (1) line breaks must be made only where the given text has
BLANK or NL; (2) each line is filled as far as possible, as long as
(3) no line will contain more than MAXPOS characters."</li>

<li>Develop a design for the above in VHLL, a very high level pseudo
code language. The pseudo code should be good enough for a
sophomore to code it in Java without any interaction with you.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgefe738c" class="outline-2">
<h2 id="orgefe738c"><span class="section-number-2">3</span> References</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Ledgard, Henry F. "The case for structured programming." BIT
Numerical Mathematics 14.1 (1974): 45-57.</li>

<li>Noonan, Robert E. "Structured programming and formal
specification." IEEE Transactions on Software Engineering, 4
(1975): 421-425.</li>

<li>Gerhart, Susan L., and Lawrence Yelowitz. "Observations of
Fallibility in Applications of Modern Programming Methodologies."
IEEE Transactions on Software Engineering, 3 (1976): 195-207.</li>

<li>McKeeman, W. M. Respecifying the telegram
problem. No. 77-2-001. U of California, Santa Cruz, 1977.</li>

<li>Torii, Koji, et al. "Functional programming and logical programming
for the telegram analysis problem." Proceedings of the 7th
international conference on Software engineering. IEEE Press, 1984.</li>

<li>Meyer, Bertrand, "On Formalism In Specifications", IEEE Software,
1985, vol. 2, no. 1. pp. 6-26. (Meyer is the designer of the
excellent OOPL named Eiffel.) Required Reading.</li>
</ol>
</div>
</div>

<div id="outline-container-orgde722ed" class="outline-2">
<h2 id="orgde722ed"><span class="section-number-2">4</span> End</h2>
<div class="outline-text-2" id="text-4">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2016 &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a>  2016-02-15
</div>
</body>
</html>
